# DimensionLineDirection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotationOptions..::..DimensionLineDirection Property
MultiReferenceAnnotationOptions Class See Also
---
The direction vector of the dimension line.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ DimensionLineDirection { get; set; }
```

Visual Basic
---
```text
Public Property DimensionLineDirection As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ DimensionLineDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: dimensionLineDirection is not length 1.0. |

# See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace